Tekla Open API Reference for Tekla Structures 2025
SettingsProxy Methods
The SettingsProxy type exposes the following members.
Methods
Name | Description
GetValue
 Gets the value of the setting with the given name.
SetValue
 Sets a setting to a value.
TryGetValue
 Tries to get the value of the setting with the given name.
Top
See Also
Reference
SettingsProxy Class
Tekla.Structures.Datatype Namespace